In [8]:
import pandas as pd
import numpy as np

## 1. Création du DataFrame

In [9]:
data = [
    ["Amine", 28, "Casablanca"],
    ["Lina", 22, "Rabat"],
    ["Youssef", 35, "Fès"],
    ["Salma", 30, "Casablanca"],
    ["Nora", np.nan, "Tanger"]
]

df = pd.DataFrame(data, columns=["Nom", "Âge", "Ville"])
print(df.head())
print(df.info())
print(df.describe())

       Nom   Âge       Ville
0    Amine  28.0  Casablanca
1     Lina  22.0       Rabat
2  Youssef  35.0         Fès
3    Salma  30.0  Casablanca
4     Nora   NaN      Tanger
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nom     5 non-null      object
 1   Âge     4 non-null      float64
 2   Ville   5 non-null      object
dtypes: float64(1), object(2)
memory usage: 252.0+ bytes
None
             Âge
count   4.000000
mean   28.750000
std     5.377422
min    22.000000
25%    26.500000
50%    29.000000
75%    31.250000
max    35.000000

## 2. Sélection et filtrage

In [10]:
print(df["Ville"])
print(df[df["Âge"] > 25])
print(df[df["Ville"] == "Casablanca"][["Nom", "Ville"]])

0    Casablanca
1         Rabat
2           Fès
3    Casablanca
4        Tanger
Name: Ville, dtype: object
       Nom   Âge       Ville
0    Amine  28.0  Casablanca
2  Youssef  35.0         Fès
3    Salma  30.0  Casablanca
     Nom       Ville
0  Amine  Casablanca
3  Salma  Casablanca

# 3. Ajout et modification

In [11]:
df["Année de Naissance"] = 2025 - df["Âge"]
df["Nom"] = df["Nom"].str.upper()
df.rename(columns={"Ville": "Localisation"}, inplace=True)
print(df)

       Nom   Âge Localisation  Année de Naissance
0    AMINE  28.0   Casablanca              1997.0
1     LINA  22.0        Rabat              2003.0
2  YOUSSEF  35.0          Fès              1990.0
3    SALMA  30.0   Casablanca              1995.0
4     NORA   NaN       Tanger                 NaN

# 4. Gestion des valeurs manquantes

In [12]:
df.loc[1, "Âge"] = np.nan
print(df[df.isnull().any(axis=1)])

moyenne = df["Âge"].mean()
df["Âge"] = df["Âge"].fillna(moyenne)
print(df)

    Nom  Âge Localisation  Année de Naissance
1  LINA  NaN        Rabat              2003.0
4  NORA  NaN       Tanger                 NaN
       Nom   Âge Localisation  Année de Naissance
0    AMINE  28.0   Casablanca              1997.0
1     LINA  31.0        Rabat              2003.0
2  YOUSSEF  35.0          Fès              1990.0
3    SALMA  30.0   Casablanca              1995.0
4     NORA  31.0       Tanger                 NaN

# 5. Tri et suppression

In [13]:
df = df.sort_values(by="Âge", ascending=False)
df = df.drop(columns=["Année de Naissance"])
df = df.drop(index=df.index[0])
print(df)

     Nom   Âge Localisation
4   NORA  31.0       Tanger
1   LINA  31.0        Rabat
3  SALMA  30.0   Casablanca
0  AMINE  28.0   Casablanca